[
    {
        "title": "Welcome to this blog!",
        "desc": "A random post number 1 just telling you about this blog.",
        "date": "20-02-2022",
        "post": "So you are finally here! I welcome you to this blog. Since a long time I wanted to code and run a blog to share my knowledge with the world. A blog with full of futuristic tech posts and a blog with a special interest in space-faring future. Thanks to a school project - it is finally here - 'Re-Think'.<br><br>The name of the blog may be way too old and not so suited but it literally took me a day to think of a name (yes, this <em>rethink</em> type name). But anyways, I hope the readers and viewers will manage the vintage-ness of the name and pardon me for that.<br><br>Okay, so let's get to the point - what can the readers expect from this blog? Umm.. before telling you this - would you mind me giving a few seconds of your reading in knowing a bit about me? ...thanks :) So, I am a random programmer and a futurist techie in general (that's it).<br><br>Pardon for the interruption but let's start with the expectations now. You can expect blog posts from a varied range of topics but everything under the general umbrella of <em>futurism</em>. Anything related to engineering, technology, philosophy, psychology can be found. The posts will be designed and written in such a way (I hope so) that the readers won't lose their interest in them.<br>....<br>....<br>(Wondering what else should be included in the introduction post...) I guess that's it for the welcoming of our readers.<br><br>See you around.. reading :)"
    },
    {
        "title": "Want to live on Mars?",
        "desc": "You need to do a lot of work to really live on the red planet.",
        "date": "21-02-2022",
        "post": "\"Living on Mars\" - sounds very fascinating! <br>But have you ever wondered what are the various steps that are to be taken in order to make the planet perfect for living. Well, this' is where the word <i>terraforming</i> steps in.<br><br><u>Terraforming Of Mars</u><br>Terraforming of the planet will be done in phases.<br><ol><li>Warming up the planet and making the atmosphere thick</li><li>Watering the planet</li><li>Fertilizing the planet</li><li>Populating the planet</li></ol><br><div class='cem'><img src=\"/resources/media/post2flowchart1phases.png\" alt=\"flowchart\"></div><br><br><u>PHASE-I</u><br><ul><li>We'd most probably begin by detonating thermonuclear weapons over the polar ice caps... sounding hazardous - well at-least not for our so cold mars.</li><li>This'd release CO2 trapped inside dry ice on the surface.</li><li>The resulting greenhouse effect would slowly thicken the atmosphere.</li><li>Incoming solar energy would start to get trapped, warming up the planet.</li></ul><br><div class='cem'><img src=\"http://www.nasa.gov/sites/default/files/thumbnails/image/mars_landscape_dry_wet_0.png\" alt=\"comarison\" width='400'></div><br><br><u>PHASE_II</u><br><ul><li>Giant orbital mirrors to focus sunlight over polar ice.</li><li>Planetary seas would begin to form across the planet.</li><li>Rainwater would be formed as well as the asteroids would also help in watering the planet.</li></ul><br><div class='cem'><img src=\"https://i0.wp.com/sitn.hms.harvard.edu/wp-content/uploads/2015/10/Mars_water.jpg\" alt=\"comarison\" width='400'></div><br><br><u>PHASE-III</u><br><ul><li>On Earth, genetically engineered algae, bacteria and fungi be produced and these would be deployed to mars to create organic soild and release O2.</li><li>Once O2 levels are normalised, we could begin planting fruits and vegetables.</li></ul><br><div class='cem'><img src=\"https://www.acs.org/content/acs/en/education/resources/highschool/chemmatters/past-issues/2016-2017/april-2017/growing-green-on-the-red-planet/_jcr_content/bottomContent/articleContent/columnsbootstrap/column1/acscontainer/containerPar/acscontainer/containerPar/image.img.jpg/1490406516000.jpg\" alt=\"comarison\" width='400'></div><br><br><u>PHASE-IV</u><br><ul><li>The first would be robots sent to prepare Mars for humanity's arrival.</li><li>Robotic 3D printers would utilise surface materials to print home and other structures.</li><li>When the basic infrastructure is in place, humans would begin to arrive.</li></ul><br><div class='cem'><img src=\"https://i.insider.com/5ba3f311de9560d8058b4569?width=1000&format=jpeg&auto=webp\" alt=\"comarison\" width='400'></div><br><br><u>Let's wrap up!</u><br>The task of creating mars habitable is going to be huge as well as challenging - but it is the human nature to undertake challenges and we generally.. love challenges. We, humans, have to work hard to make this dream come true and hopefully we'll be able to make mars our second home :)<br>"
    },
    {
        "title": "The equation that changed my life.",
        "desc": "Can a products be smaller than the numbers multiplied? Yes, even in real life.",
        "date": "03-03-2022",
        "post": "I read an article online on the equation <b>0.8 * 0.2 = 0.16</b><br><br>If you observe this equation really closely, you will see that the product <em>(0.16)</em> is smaller than the numbers multiplied <b>(0.8 and 0.2)</b>.<br>But, multiplication is adding and adding always increases! This is definitely somethings to ponder upon.<br><img src=\"/resources/media/post3equation.png\" alt=\"eq\"><br>If you really go in deep mathematically, then this starts making sense as we are adding 0.8 0.2 times i.e. ofcourse adding less than its actual value, so the product indeed makes sense. Yes, certainly but try taking a look into the equation a bit psychologically and philosophically.<br><br>Let's get to focus. This equation explains a very useful life lesson. If we put less effort or focus into something then we are indeed spending the same amount of time but getting reduced return. If we put out 100% focus into something then we get exponentially increasing results and vice-versa as you have already seen.<br><br>I'd suggest you to write this equation on a piece of paper and paste it somewhere around your workplace to remind yourself how important your time and efforts are.<br>"
    }
]